Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Failed to open SSH channel for port forwarding
fr: Échec de l'ouverture du canal SSH pour le redirection de port.
ko: 포트 포워딩용 SSH 채널을 열지 못했습니다
tr: Port yönlendirme için SSH kanalı açılamadı
vi: Không thể mở kênh SSH để chuyển tiếp cổng
zh_hans: 无法打开 SSH 通道进行端口转发
zh_hant: 無法開啟 SSH 隧道以進行連接埠轉送

source: New Group
fr: Nouveau groupe
ko: 새 그룹
tr: Yeni Grup
vi: Nhóm mới
zh_hans: 新建分组
zh_hant: 新增群組

source: New User or Role
fr: Nouveau utilisateur ou rôle
ko: 새 사용자 또는 역할
tr: Yeni Kullanıcı veya Rol
vi: Người dùng hoặc vai trò mới
zh_hans: 新建用户或角色
zh_hant: 新增使用者或角色

source: Character Set
fr: Police de caractères
ko: 문자 집합
tr: Karakter Kümesi
vi: Bộ ký tự
zh_hans: 字符集
zh_hant: 字集

source: No sorting (engine order)
fr: Pas de tri (ordre du moteur)
ko: 정렬 안 함(엔진 순서)
tr: Sıralama yok (motor sırası)
vi: Không sắp xếp (theo thứ tự engine)
zh_hans: 不排序（引擎顺序）
zh_hant: 不排序（引擎順序）

source: Delete Session…
fr: Supprimer la session...

source: Don't save
fr: Ne sauvegardez pas

source: Rows the statement returned
fr: Les lignes de la déclaration renvoyée
ko: 명령문이 반환한 행
tr: İfadenin döndürdüğü satırlar
vi: Số dòng mà câu lệnh trả về
zh_hans: 该语句返回的行
zh_hant: 該陳述式回傳的列

source: Query
fr: Interrogation
ko: 쿼리
tr: Sorgu
vi: Truy vấn
zh_hans: 查询
zh_hant: 查詢

source: Copy with Signature
fr: Copie avec signature
ko: 시그니처 포함 복사
tr: İmzayla Kopyala
vi: Sao chép kèm chữ ký
zh_hans: 带签名复制
zh_hant: 連同簽章一起複製

source: Unlicensed
fr: Sans licence
ko: 라이선스 없음
vi: Chưa có giấy phép
zh_hans: 未授权
zh_hant: 未授權

source: This DROP query will permanently remove database objects. This action cannot be undone.
fr: Cette requête DROP supprimera définitivement les objets de la base de données. Cette action ne peut pas être annulée.
ko: 이 DROP 쿼리는 데이터베이스 객체를 영구적으로 제거합니다. 이 작업은 실행 취소할 수 없습니다.
vi: Truy vấn DROP này sẽ xóa vĩnh viễn các đối tượng cơ sở dữ liệu. Thao tác này không thể hoàn tác.
zh_hans: 此 DROP 查询将永久删除数据库对象。此操作无法撤销。
zh_hant: 此 DROP 查詢將永久移除資料庫物件。此動作無法復原。

source: Ask Every Time
fr: Demandez à chaque fois

source: Toggle Query History (⌘⇧H)
fr: Activer l'historique des requêtes (⌘⇧H)
ko: 쿼리 기록 표시/숨기기(⌘⇧H)
vi: Bật/tắt lịch sử truy vấn (⌘⇧H)
zh_hans: 切换查询历史 (⌘⇧H)
zh_hant: 切換查詢歷史 (⌘⇧H)

source: Stop Import?
fr: Arrêter l'importation ?

source: Refresh license status from server
fr: Recharger l'état de la licence depuis le serveur
ko: 서버에서 라이선스 상태 새로 고침
tr: Sunucudan lisans durumunu yenile
vi: Làm mới trạng thái giấy phép từ máy chủ
zh_hans: 从服务器刷新许可证状态
zh_hant: 從伺服器重新整理授權狀態

source: License validation failed
fr: Validation de la licence échouée
ko: 라이선스 유효성 검사 실패
tr: Lisans doğrulaması başarısız oldu
vi: Xác thực giấy phép thất bại
zh_hans: 许可证验证失败
zh_hant: 授權驗證失敗

source: The %@ plugin is turned off.
fr: Le plugin %@ est désactivé.

source: Expiration date
fr: Date d'expiration
ko: 만료일
tr: Son kullanma tarihi
vi: Ngày hết hạn
zh_hans: 过期日期
zh_hant: 到期日期

source: Enter the ElastiCache cache name (replication group ID) to use IAM authentication.
fr: Entrez le nom de la cache ElastiCache (ID du groupe de réplication) pour utiliser l'authentification IAM.
ko: IAM 인증에 사용할 ElastiCache 캐시 이름(복제 그룹 ID)을 입력하십시오.
tr: IAM kimlik doğrulamasını kullanmak için ElastiCache önbellek adını (çoğaltma grubu kimliği) girin.
vi: Nhập tên cache ElastiCache (replication group ID) để dùng xác thực IAM.
zh_hans: 输入 ElastiCache 缓存名称（复制组 ID）以使用 IAM 认证。
zh_hant: 輸入 ElastiCache 快取名稱（複寫群組 ID）以使用 IAM 驗證。

source: Dropping table %@ permanently removes the table and all of its rows.
fr: Le retrait de la table %@ supprime définitivement la table et toutes ses lignes.
ko: 테이블 %@을(를) 삭제하면 테이블과 모든 행이 영구적으로 제거됩니다.
tr: %@ tablosunu silmek tabloyu ve tüm satırlarını kalıcı olarak kaldırır.
vi: Xóa bảng %@ sẽ loại bỏ vĩnh viễn bảng và toàn bộ dòng của nó.
zh_hans: 删除表 %@ 会永久移除该表及其所有行。
zh_hant: 刪除資料表 %@ 會永久移除該資料表及其所有列。

source: Change Not Saved
fr: Changements non enregistrés

source: %@ rows have a different number of fields
fr: %@ lignes ont un nombre différent de champs

source: %@ lines have unreadable characters
fr: Les lignes %@ contiennent des caractères non lisibles.

source: Search Schemas
fr: Rechercher les schémas

source: Deleted connection
fr: Connexion supprimée

source: Referenced column
fr: Colonne référencée
ko: 참조된 열
tr: Başvurulan sütun
vi: Cột được tham chiếu
zh_hans: 被引用的列
zh_hant: 被參照的欄位

source: Column Reorder Failed
fr: Réorganisation de la colonne échouée
ko: 열 순서 변경 실패
tr: Sütun Yeniden Sıralama Başarısız
vi: Sắp xếp lại cột thất bại
zh_hans: 列重排序失败
zh_hant: 欄位重新排序失敗

source: 60 days
fr: 60 jours
ko: 60일
tr: 60 gün
vi: 60 ngày
zh_hans: 60 天
zh_hant: 60 天

source: Revoke All
fr: Annuler tout
ko: 모두 철회
tr: Tümünü Geri Al
vi: Thu hồi tất cả
zh_hans: 全部撤销
zh_hant: 全部撤銷

source: No table structure
fr: Pas de structure de table

source: Statements that read or write files, or that run server-side code, cannot be sent from outside the app. Run this one in TablePro instead.
fr: Les déclarations qui lisent ou écrivent des fichiers, ou qui exécutent du code côté serveur, ne peuvent pas être envoyées depuis l'extérieur de l'application. Exécutez-en une autre dans TablePro à la place.

# Showing %lld of %lld
source: Showing %1$lld of %2$lld
fr: Affichage de %1$lld de %2$lld
ko: 전체 %2$lld개 중 %1$lld개 표시
tr: %2$lld içinden %1$lld gösteriliyor
vi: Đang hiện %1$lld trên %2$lld
zh_hans: 正在显示 %1$lld / %2$lld
zh_hant: 正在顯示 %1$lld / %2$lld

source: SSH host is required
fr: Un hôte SSH est requis.
ko: SSH 호스트가 필요합니다
tr: SSH sunucusu gereklidir
vi: Cần nhập máy chủ SSH
zh_hans: 需要 SSH 主机
zh_hant: 需要 SSH 主機

source: Creating…
fr: Créer...
ko: 생성 중…
tr: Oluşturuluyor…
vi: Đang tạo…
zh_hans: 创建中…
zh_hant: 建立中…

source: Inherited from %@
fr: Hérité de %@
ko: %@에서 상속됨
tr: %@ kaynağından devralındı
vi: Kế thừa từ %@
zh_hans: 继承自 %@
zh_hant: 繼承自 %@

source: Delete Connection…
fr: Supprimer la connexion...

source: Authentication required to execute write operations
fr: Authentification requise pour exécuter les opérations d'écriture.
ko: 쓰기 작업을 실행하려면 인증이 필요합니다
tr: Yazma işlemlerini çalıştırmak için kimlik doğrulama gerekli
vi: Cần xác thực để thực thi thao tác ghi
zh_hans: 执行写入操作需要身份验证
zh_hant: 執行寫入操作需要身分驗證

source: The text could not be parsed as JSON.
fr: Le texte n'a pas pu être analysé en JSON.
ko: 텍스트를 JSON으로 구문 분석할 수 없습니다.
tr: Metin JSON olarak ayrıştırılamadı.
vi: Không thể phân tích văn bản dưới dạng JSON.
zh_hans: 无法将文本解析为 JSON。
zh_hant: 無法將文字剖析為 JSON。

source: Tables start out of the comparison so a first run cannot stream every row.
fr: Les tableaux commencent à partir de la comparaison, donc une première exécution ne peut pas diffuser chaque ligne.
ko: 첫 실행에서 모든 행을 읽지 않도록, 테이블은 비교에서 빠진 상태로 시작합니다.
tr: Tablolar karşılaştırmanın dışında başlar, böylece ilk çalıştırma her satırı akıtmaz.
vi: Bảng khởi đầu ở ngoài so sánh, nên lần chạy đầu tiên không đọc toàn bộ dòng.
zh_hans: 表默认不在比较范围内，因此首次运行不会流式读取每一行。
zh_hant: 資料表預設不在比較範圍內，因此首次執行不會串流讀取每一列。

source: The %@ plugin is not installed. Would you like to download it from the plugin marketplace?
fr: Le plugin %@ n'est pas installé. Voulez-vous le télécharger depuis le marché des plugins ?
ko: %@ 플러그인이 설치되어 있지 않습니다. 플러그인 마켓플레이스에서 다운로드하시겠습니까?
tr: The %@ plugin is not installed. Would you like to indirme it from the plugin marketplace?
vi: Plugin %@ chưa được cài đặt. Bạn có muốn tải về từ chợ plugin?
zh_hans: %@ 插件未安装。是否要从插件市场下载？
zh_hant: 尚未安裝 %@ 外掛。是否要從外掛市集下載？

source: Filter roles
fr: Filtrer les rôles
ko: 역할 필터링
tr: Rolleri filtrele
vi: Lọc vai trò
zh_hans: 筛选角色
zh_hant: 篩選角色

source: Not a number
fr: Pas un nombre

source: Add Label Before…
fr: Ajouter l'étiquette avant...

source: (%lld active)
fr: (%lld actifs)
ko: (%lld개 활성)
tr: (%lld etkin)
vi: (%lld đang hoạt động)
zh_hans: (%lld 活跃)
zh_hant: (%lld 個使用中)

source: Database type: %@
fr: Type de base de données : %@
ko: 데이터베이스 유형: %@
tr: Veritabanı türü: %@
vi: Loại cơ sở dữ liệu: %@
zh_hans: 数据库类型: %@
zh_hant: 資料庫類型：%@

source: about %@ rows
fr: Environ %@ lignes

source: Switch First Row Between Header and Data
fr: Changer la première ligne entre le titre et les données.
ko: 첫 번째 행을 머리글과 데이터 간에 전환
tr: İlk Satırı Başlık ve Veri Arasında Değiştir
vi: Chuyển hàng đầu giữa tiêu đề và dữ liệu
zh_hans: 在标题行与数据行之间切换第一行
zh_hant: 在標題列與資料列之間切換第一列

source: Approximate row count, when requested
fr: Nombre approximatif de lignes, sur demande.
ko: 요청 시 대략적인 행 수
tr: İstendiğinde yaklaşık satır sayısı
vi: Số dòng ước tính, khi được yêu cầu
zh_hans: 请求时返回的大致行数
zh_hant: 請求時回傳的大致列數

source: No Table Selected
fr: Aucune table sélectionnée
ko: 선택된 테이블 없음
tr: Tablo Seçilmedi
vi: Chưa chọn bảng
zh_hans: 未选择表
zh_hant: 未選擇資料表

source: "%@" is not a valid AWS region.
fr: « %@ » n’est pas une région AWS valide.

source: Service account key (JSON)
fr: Clé du compte de service (JSON)
ko: 서비스 계정 키(JSON)
tr: Servis hesabı anahtarı (JSON)
vi: Khóa tài khoản dịch vụ (JSON)
zh_hans: 服务账号密钥（JSON）
zh_hant: 服務帳號金鑰（JSON）

# Plugin '%@' has an invalid descriptor: %@
source: Plugin '%1$@' has an invalid descriptor: %2$@
fr: Le plugin '%1$@' a un dénominateur invalide : %2$@
ko: 플러그인 '%1$@'의 설명자가 올바르지 않습니다: %2$@
tr: '%@' eklentisinin tanımlayıcısı geçersiz: %@
vi: Plugin '%@' có mô tả không hợp lệ: %@
zh_hans: 插件 '%@' 的描述符无效：%@
zh_hant: 外掛「%1$@」的描述元無效：%2$@

source: Edit Foreign Key
fr: Modifier la clé étrangère
ko: 외래 키 편집
tr: Yabancı Anahtarı Düzenle
vi: Sửa khoá ngoại
zh_hans: 编辑外键
zh_hant: 編輯外鍵

source: Primary
fr: Primaire

source: Ask: read-only schema lookups. AI can browse but not run queries.
fr: Demander : recherches de schémas en lecture seule. L'IA peut parcourir mais ne peut pas exécuter de requêtes.
ko: 질문: 읽기 전용 스키마 조회만 가능합니다. AI는 탐색할 수 있지만 쿼리를 실행할 수 없습니다.
tr: Sor: salt okunur şema sorgulamaları. Yapay zeka göz atabilir ama sorgu çalıştıramaz.
vi: Ask: chỉ tra cứu schema ở chế độ chỉ đọc. AI có thể duyệt nhưng không chạy truy vấn.
zh_hans: Ask：只读Schema查看。AI可以浏览但不能运行查询。
zh_hant: Ask：唯讀的綱要查看。AI 可以瀏覽但不能執行查詢。

source: %1$@ has no equivalent here, so the values arrive as %2$@.
fr: %1$@ n'a pas d'équivalent ici, donc les valeurs arrivent sous la forme de %2$@.

source: Access
fr: Accès
ko: 접근 권한
tr: Erişim
vi: Quyền truy cập
zh_hans: 访问权限
zh_hant: 存取權限

source: Connection the transaction runs on
fr: Connexion sur laquelle la transaction est exécutée
ko: 트랜잭션이 실행되는 연결
tr: İşlemin çalıştığı bağlantı
vi: Kết nối mà transaction chạy trên đó
zh_hans: 事务运行所在的连接
zh_hant: 交易執行所在的連線

source: Text matched against the recorded statement
fr: Texte correspondant à la déclaration enregistrée
ko: 기록된 명령문과 대조할 텍스트
tr: Kaydedilen ifadeyle eşleştirilen metin
vi: Văn bản được so khớp với câu lệnh đã ghi
zh_hans: 用于匹配已记录语句的文本
zh_hant: 用於比對已記錄陳述式的文字

source: This may permanently modify or delete data and cannot be undone.
fr: Cela peut modifier ou supprimer définitivement les données et ne peut pas être annulé.

source: Select a Plugin
fr: Sélectionnez un plugin
ko: 플러그인 선택
tr: Bir Eklenti Seçin
vi: Chọn một Plugin
zh_hans: 选择一个插件
zh_hant: 選擇外掛

source: No matching connections
fr: Aucune connexion correspondante
ko: 일치하는 연결 없음
vi: Không có kết nối nào khớp
zh_hans: 无匹配连接
zh_hant: 無符合的連線

source: export
fr: exportation
ko: 내보내기
tr: dışa aktar
vi: xuất
zh_hans: 导出
zh_hant: 匯出

source: Turn one table's structure into a runnable checklist of data quality queries
fr: Transforme la structure d'une table en une liste de contrôle exécutable de requêtes de qualité des données.
ko: 한 테이블의 구조를 실행 가능한 데이터 품질 쿼리 체크리스트로 바꿉니다
tr: Bir tablonun yapısını, çalıştırılabilir bir veri kalitesi sorguları kontrol listesine dönüştürür
vi: Biến cấu trúc của một bảng thành một danh sách truy vấn kiểm tra chất lượng dữ liệu có thể chạy được
zh_hans: 把一张表的结构转成一份可运行的数据质量查询清单
zh_hant: 把一張資料表的結構轉成一份可執行的資料品質查詢清單

source: Conflicted
fr: Contraint

source: The saved groups could not be read. Nothing was changed.
fr: Les groupes enregistrés ne pouvaient pas être lus. Rien n'a été modifié.
ko: 저장된 그룹을 읽을 수 없습니다. 아무것도 변경되지 않았습니다.
tr: Kayıtlı gruplar okunamadı. Hiçbir şey değiştirilmedi.
vi: Không đọc được các nhóm đã lưu. Không có gì thay đổi.
zh_hans: 无法读取已保存的分组。未做任何更改。
zh_hant: 無法讀取已儲存的群組。未做任何變更。

source: Terminate
fr: Mettre fin à
ko: 종료
tr: Sonlandır
vi: Kết thúc
zh_hans: 终止
zh_hant: 終止

# Export %lld row(s) to %@
source: Export %1$lld row(s) to %2$@
fr: Exporter %1$lld ligne(s) vers %2$@
ko: %1$lld개 행을 %2$@(으)로 내보내기
tr: %lld satırı %@ olarak dışa aktar
vi: Export %lld hàng sang %@
zh_hans: 导出 %lld 行到 %@
zh_hant: 匯出 %1$lld 列至 %2$@

source: Copy Details copies the rest.
fr: Copier les détails copie le reste.

source: Move Group To
fr: Déplacer le groupe vers
ko: 그룹 이동
tr: Grubu Taşı
vi: Di chuyển nhóm đến
zh_hans: 移动分组到
zh_hant: 移動群組至

source: %@ cannot add or remove a table's foreign keys.
fr: %@ ne peut pas ajouter ni supprimer les clés étrangères d’une table.

source: Get help writing queries, explaining schemas, or fixing errors.
fr: Obtenez de l'aide pour rédiger des requêtes, expliquer des schémas ou corriger des erreurs.
ko: 쿼리 작성, 스키마 설명 또는 오류 수정에 관한 도움을 받습니다.
tr: Sorgu yazma, şema açıklama veya hata düzeltme konusunda yardım alın.
vi: Nhận trợ giúp viết truy vấn, giải thích schema hoặc sửa lỗi.
zh_hans: 获取编写查询、解释 Schema 或修复错误方面的帮助。
zh_hant: 取得撰寫查詢、解釋綱要或修正錯誤的協助。

source: If the SSH server asks for a verification code, TablePro prompts you for it when you connect.
fr: Si le serveur SSH demande un code de vérification, TablePro vous le demande lors de la connexion.
ko: SSH 서버에서 확인 코드를 요청하면 연결할 때 TablePro가 코드 입력을 요청합니다.
tr: SSH sunucusu bir doğrulama kodu isterse, TablePro bağlanırken bunu size sorar.
vi: Nếu máy chủ SSH yêu cầu mã xác minh, TablePro sẽ hỏi bạn khi kết nối.
zh_hans: 如果 SSH 服务器要求验证码，TablePro 会在连接时提示你输入。
zh_hant: 如果 SSH 伺服器要求驗證碼，TablePro 會在連線時提示你輸入。

source: /fix needs a query that failed. Run the query first.
fr: /fix a besoin d’une requête ayant échoué. Exécutez d’abord la requête.

source: Save as Preset…
fr: Enregistrer sous Préréglage...
ko: 프리셋으로 저장…
tr: Ön Ayar Olarak Kaydet…
vi: Lưu dưới dạng mẫu…
zh_hans: 另存为预设…
zh_hant: 另存為預設集…

source: Copy JSON
fr: Copier le JSON
ko: JSON 복사
tr: JSON Kopyala
vi: Sao chép JSON
zh_hans: 复制 JSON
zh_hant: 複製 JSON

source: Status: stopped
fr: Statut : arrêté
ko: 상태: 중지됨
tr: Durum: durduruldu
vi: Trạng thái: đã dừng
zh_hans: 状态：已停止
zh_hant: 狀態：已停止

source: Executed %lld statements
fr: Déclarations %lld exécutées
ko: 문 %lld개 실행됨
tr: çalıştırıldı %lld ifade
vi: Đã thực thi %lld câu lệnh
zh_hans: 已执行 %lld 条语句
zh_hant: 已執行 %lld 條陳述式

# %@ requires the %@ plan
source: %1$@ requires the %2$@ plan
fr: %1$@ nécessite le plan %2$@
ko: %1$@에는 %2$@ 플랜이 필요합니다
tr: %1$@ için %2$@ planı gerekir
vi: %1$@ yêu cầu gói %2$@
zh_hans: %1$@ 需要 %2$@ 方案
zh_hant: %1$@ 需要 %2$@ 方案

source: Compress the file using Gzip
fr: Comprimez le fichier à l'aide de Gzip
ko: Gzip으로 파일 압축
tr: Dosyayı Gzip ile sıkıştır
vi: Nén tệp bằng Gzip
zh_hans: 使用 Gzip 压缩文件
zh_hant: 使用 Gzip 壓縮檔案

source: DuckDB copies the whole database. There is no table filter.
fr: DuckDB copie toute la base de données. Il n'y a pas de filtre de table.

source: File Modified Externally
fr: Fichier modifié de manière externe
ko: 외부에서 파일이 수정됨
tr: Dosya Dışarıdan Değiştirildi
vi: Tệp bị sửa đổi bên ngoài
zh_hans: 文件已在外部被修改
zh_hant: 檔案已在外部被修改

source: Couldn't publish to the team catalog
fr: Impossible de publier dans le catalogue de l'équipe
ko: 팀 카탈로그에 게시할 수 없습니다
tr: Takım kataloğuna yayınlanamadı
vi: Không thể xuất bản lên danh mục nhóm
zh_hans: 无法发布到团队目录
zh_hant: 無法發佈到團隊目錄

source: %d connections were imported.
fr: %d connexions ont été importées.
ko: %d개 연결을 가져왔습니다.
tr: %d bağlantı içe aktarıldı.
vi: Đã nhập %d kết nối.
zh_hans: 已导入%d个连接。
zh_hant: 已匯入 %d 個連線。

source: %1$lld rows from 1 table written to %2$@.
fr: %1$lld lignes de 1 table écrites sur %2$@.

source: Not supported for this database. Use CASCADE instead.
fr: Pas pris en charge pour cette base de données. Utilisez plutôt CASCADE.
ko: 이 데이터베이스에서는 지원되지 않습니다. 대신 CASCADE를 사용하십시오.
tr: Bu veritabanında desteklenmiyor. Bunun yerine CASCADE kullanın.
vi: Không hỗ trợ cho cơ sở dữ liệu này. Hãy dùng CASCADE thay thế.
zh_hans: 此数据库不支持。请使用 CASCADE 代替。
zh_hant: 此資料庫不支援。請改用 CASCADE。

source: Cursor blink
fr: Clignotement du curseur
ko: 커서 깜박임
tr: İmleç yanıp sönme
vi: Nhấp nháy con trỏ
zh_hans: 光标闪烁
zh_hant: 游標閃爍

source: The listener is blocking new connections to the requested service
fr: L'auditeur bloque les nouvelles connexions vers le service demandé.
ko: 리스너가 요청한 서비스에 대한 새 연결을 차단하고 있습니다
tr: Dinleyici istenen hizmete yeni bağlantıları engelliyor
vi: Listener đang chặn các kết nối mới tới dịch vụ được yêu cầu
zh_hans: 侦听器正在阻止到所请求服务的新连接
zh_hant: 接聽程式正在阻擋到所請求服務的新連線

source: Search every column
fr: Rechercher dans chaque colonne

source: Build the SQL that brings the target in line
fr: Construisez la SQL qui met la cible en ligne.
ko: 대상을 맞추는 SQL 생성
tr: Hedefi hizaya getiren SQL'i oluştur
vi: Tạo SQL để đưa đích về đúng trạng thái
zh_hans: 生成让目标保持一致的 SQL
zh_hant: 產生讓目標保持一致的 SQL

source: Close Database “%@”
fr: Fermer la base de données "%@"
ko: 데이터베이스 “%@” 닫기
tr: “%@” Veritabanını Kapat
vi: Đóng cơ sở dữ liệu “%@”
zh_hans: 关闭数据库“%@”
zh_hant: 關閉資料庫「%@」

source: Don't Sort
fr: Ne triez pas
ko: 정렬 안 함
tr: Sıralama
vi: Không sắp xếp
zh_hans: 不排序
zh_hant: 不排序

source: Current connection
fr: Connexion actuelle

source: Choose the columns shown beside each key
fr: Choisissez les colonnes affichées à côté de chaque clé.
ko: 각 키 옆에 표시할 열을 선택합니다
tr: Her anahtarın yanında gösterilecek sütunları seçin
vi: Chọn các cột hiển thị cạnh mỗi khóa
zh_hans: 选择每个键旁边显示的列
zh_hant: 選擇每個鍵旁邊顯示的欄位

source: Privilege name
fr: Nom du privilège
ko: 권한 이름
tr: Ayrıcalık adı
vi: Tên đặc quyền
zh_hans: 权限名称
zh_hant: 權限名稱

source: %1$@ on %2$@
fr: %1$@ sur %2$@
ko: %2$@에서 %1$@
tr: %2$@ üzerinde %1$@
vi: %1$@ trên %2$@
zh_hans: %2$@ 上的 %1$@
zh_hant: %2$@ 上的 %1$@

source: Search Latency
fr: Latence de recherche

source: Clear All History?
fr: Effacer toute l'historique ?
ko: 모든 기록을 지우겠습니까?
tr: Tüm Geçmiş Temizlensin mi?
vi: Xóa toàn bộ lịch sử?
zh_hans: 清除全部历史？
zh_hant: 清除全部歷程記錄？

source: Average Time
fr: Temps moyen
ko: 평균 시간
tr: Ortalama Süre
vi: Thời gian trung bình
zh_hans: 平均耗时
zh_hant: 平均耗時

source: Query Execution
fr: Exécution de la requête
ko: 쿼리 실행
tr: Sorgu Çalıştırma
vi: Thực thi truy vấn
zh_hans: 查询执行
zh_hant: 查詢執行

source: CA Certificate
fr: Certificat CA
ko: CA 인증서
tr: CA Sertifikası
vi: Chứng chỉ CA
zh_hans: CA 证书
zh_hant: CA 憑證

source: %d rows could not be read back from the target by key. Compare again.
fr: %d lignes n'ont pas pu être lu à nouveau à partir de la cible par clé. Comparez à nouveau.

source: The Cursor CLI is not installed. Install it, then sign in.
fr: Le Cursor CLI n'est pas installé. Installez-le, puis connectez-vous.
ko: Cursor CLI가 설치되어 있지 않습니다. 설치한 다음 로그인하십시오.
tr: Cursor CLI yüklü değil. Yükleyin, sonra giriş yapın.
vi: Cursor CLI chưa được cài đặt. Hãy cài đặt rồi đăng nhập.
zh_hans: 未安装 Cursor CLI。请先安装，然后登录。
zh_hant: 尚未安裝 Cursor CLI。請先安裝，然後登入。

source: Quote
fr: Citation
ko: 따옴표 처리
vi: Dấu ngoặc kép
zh_hans: 引号
zh_hant: 引號

source: Remove Invisible Characters
fr: Supprimer les caractères invisibles
ko: 보이지 않는 문자 제거
tr: Görünmez Karakterleri Kaldır
vi: Xóa ký tự ẩn
zh_hans: 移除不可见字符
zh_hant: 移除不可見字元

source: Replace the current text with this version
fr: Remplacez le texte actuel par cette version.

# SQL is too long: %d characters (limit %d)
source: SQL is too long: %1$d characters (limit %2$d)
fr: SQL est trop long : %1$d caractères (limite %2$d)
ko: SQL이 너무 깁니다: %1$d자(제한: %2$d자)
tr: SQL çok uzun: %d karakter (sınır %d)
vi: SQL quá dài: %d ký tự (giới hạn %d)
zh_hans: SQL 过长：%d 个字符（上限 %d）
zh_hant: SQL 過長：%1$d 個字（上限 %2$d）

source: Cancelled
fr: Annulé
ko: 취소됨
tr: İptal edildi
vi: Đã hủy
zh_hans: 已取消
zh_hant: 已取消

source: Remote (Turso)
fr: Télécommandé (Turso)
ko: 원격(Turso)
tr: Uzak (Turso)
vi: Từ xa (Turso)
zh_hans: 远程 (Turso)
zh_hant: 遠端 (Turso)

source: Adjust Limit
fr: Ajuster la limite
ko: 제한 조정
tr: Limiti Ayarla
vi: Điều chỉnh giới hạn
zh_hans: 调整限制
zh_hant: 調整上限

source: Open AI settings to change the tool call limit.
fr: Ouvrez les paramètres d'IA pour modifier la limite d'appels d'outils.
ko: 도구 호출 한도를 변경하려면 AI 설정을 여십시오.
tr: Araç çağrısı limitini değiştirmek için AI ayarlarını açın.
vi: Mở cài đặt AI để thay đổi giới hạn gọi công cụ.
zh_hans: 打开 AI 设置以更改工具调用上限。
zh_hant: 開啟 AI 設定以變更工具呼叫上限。

source: Save Selection…
fr: Enregistrer la sélection...

source: Open SQL Editor
fr: Ouvrir l'éditeur SQL
ko: SQL 편집기 열기
vi: Mở trình soạn SQL
zh_hans: 打开 SQL 编辑器
zh_hant: 開啟 SQL 編輯器

source: Toggle Results (⌘⌥R)
fr: Changer les résultats (⌘⌥R)
ko: 결과 표시/숨기기(⌘⌥R)
tr: Sonuçları Aç/Kapat (⌘⌥R)
vi: Ẩn/hiện kết quả (⌘⌥R)
zh_hans: 显示/隐藏结果（⌘⌥R）
zh_hant: 顯示/隱藏結果 (⌘⌥R)

source: Edit Trigger
fr: Modifier le déclencheur
ko: 트리거 편집
tr: Tetikleyiciyi Düzenle
vi: Sửa trigger
zh_hans: 编辑触发器
zh_hant: 編輯觸發器

source: Filename cannot be empty
fr: Le nom du fichier ne peut pas être vide.
ko: 파일 이름은 비워 둘 수 없습니다
tr: Dosya adı boş olamaz
vi: Tên tệp không được để trống
zh_hans: 文件名不能为空
zh_hant: 檔案名稱不能為空

source: This version is not readable as text.
fr: Cette version n'est pas lisible en tant que texte.

source: Create Trigger
fr: Créer un déclencheur
ko: 트리거 생성
tr: Tetikleyici Oluştur
vi: Tạo trigger
zh_hans: 创建触发器
zh_hant: 建立觸發器

source: On Quit
fr: Sur Quitter
ko: 종료 시
tr: Çıkışta
vi: Khi thoát
zh_hans: 退出时
zh_hant: 結束時

source: Query History:
fr: Historique des requêtes :
ko: 쿼리 기록:
vi: Lịch sử truy vấn:
zh_hans: 查询历史：
zh_hant: 查詢歷史：

source: Watched folders are scanned for .tablepro files. Connections appear read only in the sidebar.
fr: Les dossiers surveillés sont scannés à la recherche de fichiers .tablepro. Les connexions apparaissent comme lues-seules dans la barre latérale.
ko: 감시 중인 폴더에서 .tablepro 파일을 검색합니다. 연결은 사이드바에 읽기 전용으로 표시됩니다.
tr: İzlenen klasörler .tablepro dosyaları için taranır. Bağlantılar Sidebar'da salt okunur olarak görünür.
vi: Các thư mục theo dõi được quét để tìm file .tablepro. Kết nối hiển thị chỉ đọc trong thanh bên.
zh_hans: 会扫描受监视文件夹中的 .tablepro 文件。这些连接在侧边栏中以只读方式显示。
zh_hant: 受監視的資料夾會被掃描以尋找 .tablepro 檔案。這些連線會在側邊欄中以唯讀方式顯示。

source: Please select a column
fr: Veuillez sélectionner une colonne
ko: 열을 선택하십시오
tr: Lütfen bir sütun seçin
vi: Vui lòng chọn một cột
zh_hans: 请选择一列
zh_hant: 請選擇一個欄位

source: Spacious
fr: Spacieux
ko: 넓게
vi: Rộng rãi
zh_hans: 宽松
zh_hant: 寬鬆

source: Tradeoffs
fr: Compromis
ko: 장단점
tr: Ödünleşimler
vi: Đánh đổi
zh_hans: 取舍
zh_hant: 取捨

source: Switching to schema '%@' timed out.
fr: Le changement de schéma '%@' a échoué en raison d'une timeout.
ko: 스키마 '%@' 전환 시간이 초과되었습니다.
tr: '%@' şemasına geçiş zaman aşımına uğradı.
vi: Chuyển sang schema '%@' đã hết thời gian chờ.
zh_hans: 切换到 Schema '%@' 超时。
zh_hant: 切換到綱要 '%@' 已逾時。

source: Groups nest up to %lld levels.
fr: Les groupes s'entrelacent jusqu'à %lld niveaux.
ko: 그룹은 최대 %lld단계까지 중첩됩니다.
tr: Gruplar en fazla %lld düzeye kadar iç içe geçebilir.
vi: Nhóm lồng nhau tối đa %lld cấp.
zh_hans: 分组最多嵌套 %lld 层。
zh_hant: 群組最多巢狀 %lld 層。

source: Running Threads
fr: Fils de discussion en cours
ko: 실행 중인 스레드
tr: Çalışan İş Parçacıkları
vi: Luồng đang chạy
zh_hans: 运行中的线程
zh_hant: 執行中的執行緒

source: Apply to Editor
fr: Postuler à l'éditeur
ko: 편집기에 적용
tr: Düzenleyiciye Uygula
vi: Áp dụng vào trình soạn thảo
zh_hans: 应用到编辑器
zh_hant: 套用到編輯器

source: Choose a name and location for the new database. TablePro creates it when you connect, and opens a file that already exists as it is.
fr: Choisissez un nom et une localisation pour la nouvelle base de données. TablePro la crée lorsque vous vous connectez et ouvre un fichier qui existe déjà tel quel.

source: Connecting to %@
fr: Connexion à %@
ko: %@에 연결 중
tr: %@ bağlantısı kuruluyor
vi: Đang kết nối tới %@
zh_hans: 正在连接%@
zh_hant: 正在連線到 %@

source: Add Enum Label
fr: Ajouter une étiquette d'enumération
